---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Alignment..::..Get Method
Alignment Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Get(Element) | Returns an Alignment object given a Revit alignment element. |
|  | Get(Document, Guid) | Returns an Alignment in the document given its GUID. |

# See Also

Alignment Class

Alignment Members

Autodesk.Revit.DB.Infrastructure Namespace